<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Crop;

class CropSeeder extends Seeder
{
    public function run(): void
    {
        $crops = [
            "トマト", "ピーマン", "ナス", "キュウリ", "カボチャ", "ズッキーニ", "オクラ", "ゴーヤ", "サツマイモ", "ジャガイモ",
            "ニンジン", "ダイコン", "タマネギ", "ネギ", "キャベツ", "レタス", "ホウレンソウ", "白菜", "小松菜", "チンゲンサイ",
            "ブロッコリー", "カリフラワー", "スイカ", "メロン", "イチゴ", "ブルーベリー", "ラズベリー", "サクランボ", "リンゴ", "ナシ",
            "ブドウ", "モモ", "プラム", "柿", "ミカン", "レモン", "ユズ", "カボス", "バナナ", "パパイヤ",
            "キウイ", "マンゴー", "パイナップル", "ラディッシュ", "ビーツ", "エンドウ", "ソラマメ", "トウモロコシ", "枝豆", "コマツナ"
        ];
        foreach ($crops as $name) {
            Crop::create(['name' => $name]);
        }
    }
}

