<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Pesticide;

class PesticideSeeder extends Seeder
{
    public function run(): void
    {
        $pesticides = [
            "ベストガード", "アファーム乳剤", "マラソン乳剤", "スミチオン乳剤", "オーソサイド水和剤", "トップジンM水和剤",
            "ダコニール1000", "ジマンダイセン水和剤", "アミスター水和剤", "ベノミル水和剤", "カリグリーン液剤",
            "カルホス水和剤", "エンドルフ水和剤", "モノフルオロン乳剤", "フェニトロチオン乳剤", "スコル液剤", "シグマ乳剤",
            "バリダシン水和剤", "チオファネートメチル水和剤", "オキソクロル水和剤", "トリフロキシストロビン水和剤",
            "ジフェノコナゾール水和剤", "クロルタロニル水和剤", "ピリダベン乳剤", "チオファネートメチル液剤", "マノゼブ水和剤",
            "メタラキシル水和剤", "ベノミル液剤", "プロクロラズ水和剤", "テブフェノジド水和剤", "ジチアノン水和剤",
            "マンコゼブ水和剤", "ピリダベン水和剤", "チアベンダゾール水和剤", "アゾキシストロビン水和剤", "ベノミル粉剤",
            "メタラキシルM水和剤", "フルオキサストロビン水和剤", "ジメトモルフ水和剤", "マンコゼブ粉剤", "チアベンダゾール粉剤", "ジフェノコナゾール液剤", "アミスター液剤", "オキソクロル液剤", "モノフルオロン液剤"
        ];
        foreach ($pesticides as $name) {
            Pesticide::create(['name' => $name]);
        }
    }
}
